### melt() function

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('sales1.csv')
df

,Unnamed: 0,date,department,fuel_price_usd_per_l,is_holiday,store,temperature_c,type,unemployment,weekly_sales
0,0,2010-02-05,1,0.679451,False,1,5.727778,A,8.106,24924.50
1,1,2010-03-05,1,0.693452,False,1,8.055556,A,8.106,21827.90
2,2,2010-04-02,1,0.718284,False,1,16.816667,A,7.808,57258.43
3,3,2010-05-07,1,0.748928,False,1,22.527778,A,7.808,17413.94
4,4,2010-06-04,1,0.714586,False,1,27.050000,A,7.808,17558.09
5,5,2010-07-02,1,0.705076,False,1,27.172222,A,7.787,16333.14
6,6,2010-08-06,1,0.693980,False,1,30.644444,A,7.787,17508.41
7,7,2010-09-03,1,0.680772,False,1,27.338889,A,7.787,16241.78
8,8,2010-10-01,1,0.687640,False,1,22.161111,A,7.838,20094.19
9,9,2010-11-05,1,0.710359,False,1,14.855556,A,7.838,34238.88
10,10,2010-12-03,1,0.715378,False,1,9.594444,A,7.838,22517.56
11,11,2011-01-07,1,0.786176,False,1,9.038889,A,7.742,15984.24

In [3]:
pd.melt(df)

         variable    value
0      Unnamed: 0        0
1      Unnamed: 0        1
2      Unnamed: 0        2
3      Unnamed: 0        3
4      Unnamed: 0        4
..            ...      ...
115  weekly_sales  16241.8
116  weekly_sales  20094.2
117  weekly_sales  34238.9
118  weekly_sales  22517.6
119  weekly_sales  15984.2

[120 rows x 2 columns]

In [4]:
pd.melt(df,id_vars=['date'])

           date      variable    value
0    2010-02-05    Unnamed: 0        0
1    2010-03-05    Unnamed: 0        1
2    2010-04-02    Unnamed: 0        2
3    2010-05-07    Unnamed: 0        3
4    2010-06-04    Unnamed: 0        4
..          ...           ...      ...
103  2010-09-03  weekly_sales  16241.8
104  2010-10-01  weekly_sales  20094.2
105  2010-11-05  weekly_sales  34238.9
106  2010-12-03  weekly_sales  22517.6
107  2011-01-07  weekly_sales  15984.2

[108 rows x 3 columns]

In [5]:
pd.melt(df,id_vars=['department'])

     department      variable    value
0             1    Unnamed: 0        0
1             1    Unnamed: 0        1
2             1    Unnamed: 0        2
3             1    Unnamed: 0        3
4             1    Unnamed: 0        4
..          ...           ...      ...
103           1  weekly_sales  16241.8
104           1  weekly_sales  20094.2
105           1  weekly_sales  34238.9
106           1  weekly_sales  22517.6
107           1  weekly_sales  15984.2

[108 rows x 3 columns]

In [7]:
pd.melt(df,id_vars=['department'],value_vars=['unemployment'])

    department      variable  value
0            1  unemployment  8.106
1            1  unemployment  8.106
2            1  unemployment  7.808
3            1  unemployment  7.808
4            1  unemployment  7.808
5            1  unemployment  7.787
6            1  unemployment  7.787
7            1  unemployment  7.787
8            1  unemployment  7.838
9            1  unemployment  7.838
10           1  unemployment  7.838
11           1  unemployment  7.742

In [8]:
pd.melt(df,id_vars=['department'],value_vars=['unemployment'],var_name='Category')

    department      Category  value
0            1  unemployment  8.106
1            1  unemployment  8.106
2            1  unemployment  7.808
3            1  unemployment  7.808
4            1  unemployment  7.808
5            1  unemployment  7.787
6            1  unemployment  7.787
7            1  unemployment  7.787
8            1  unemployment  7.838
9            1  unemployment  7.838
10           1  unemployment  7.838
11           1  unemployment  7.742